final List<Map<String, String>> questionList = [
  {
    'question': 'ازاي اعمل توكيل؟',
    'answer': 'لازم تروح الشهر العقاري ومعاك بطاقتك وبطاقات الطرف الآخر.',
  },
  {
    'question': 'ايه هي المستندات المطلوبة للطلاق؟',
    'answer': 'عقد الزواج، البطاقة، وأي مستندات تخص النزاع.',
  },
  {
    'question': 'ازاي أعمل طعن على حكم؟',
    'answer': 'تتقدم باستئناف خلال المدة القانونية المحددة (غالبًا 40 يوم).',
  },
  {
    'question': 'هل ممكن أوكل حد من غير ما يكون قريبي؟',
    'answer': 'أيوه، ينفع توكل أي شخص طالما عندك بطاقة وهو كمان.',
  },
  {
    'question': 'هل لازم محامي في قضايا الأحوال الشخصية؟',
    'answer': 'مش شرط، لكن وجود محامي بيساعدك تفهم حقوقك وإجراءات المحكمة.',
  },
  {
    'question': 'ازاي أثبت ملكية شقة؟',
    'answer': 'بعقد بيع نهائي مسجل أو حكم قضائي أو حيازة معروفة ومعلنة.',
  },
  {
    'question': 'امتى أقدر أرفع قضية نفقة؟',
    'answer': 'لو الزوج امتنع عن الصرف على زوجته أو أولاده، ممكن ترفعي قضية في أي وقت.',
  },
  {
    'question': 'هل ينفع أتنازل عن قضية بعد رفعها؟',
    'answer': 'أيوه، ممكن تتنازل طالما القضية لسه ما صدرش فيها حكم نهائي.',
  },
  {
    'question': 'ازاي أعمل إعلام وراثة؟',
    'answer': 'بتروحي المحكمة وتقدمي طلب ومعاه شهادة الوفاة وبيانات الورثة، وهيتم تحديد جلسة.',
  },
];
